In [23]:
%config Completer.use_jedi = False

## Data Frame

In [54]:
import pandas as pd
import datetime

In [ ]:
#создание DataFrame по столбцам с помощью словарей
frame = pd.DataFrame({'numbers':range(10), 'chars':['a']*10})

In [ ]:
frame

In [2]:
#создание DataFrame с помощью чтения данных из файла
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [3]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [4]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [5]:
frame.shape

(6, 4)

In [6]:
new_line = {'Name':'Perov', 'Birth':'22.03.1990', 'City':'Penza'}

In [7]:
#добавление строки в DataFrame
frame.append(new_line, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [8]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [9]:
#добавление строки в DataFrame
frame = frame.append(new_line, ignore_index=True)

In [10]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [11]:
#добавление столбца в DataFrame
frame['IsStudent'] = [False]*5 + [True]*2

In [12]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False
5     Костров С.О.  31.05.1985     Москва    стажер       True
6            Perov  22.03.1990      Penza       NaN       True

In [13]:
#удаление строк DataFrame
frame.drop([5,6], axis=0)

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False

In [14]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False
5     Костров С.О.  31.05.1985     Москва    стажер       True
6            Perov  22.03.1990      Penza       NaN       True

In [15]:
#удаление строк DataFrame (inplace)
frame.drop([5,6], axis=0, inplace=True)

In [16]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False

In [17]:
#удаление столбца DataFrame (inplace)
frame.drop('IsStudent', axis=1, inplace=True)

In [18]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

In [19]:
#запись DataFrame в файл
frame.to_csv('updated_dataset.csv', sep=',', header=True, index=False)

In [20]:
!cat updated_dataset.csv

Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер

In [21]:
#аналог команды для пользователей Windows
!more updated_dataset.csv

Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер
>d_dataset.csv (END)

In [24]:
frame.fillna('разработчик', inplace = True)

In [25]:
frame

              Name       Birth       City     Position
0      Иванов А.А.  22.03.1980     Москва  разработчик
1     Сорокин И.В.  07.08.1965  Волгоград      инженер
2       Белов М.М.  13.02.1980     Ростов     менеджер
3  Мельникова Д.С.  15.04.1985     Ростов  разработчик
4      Рыбина Е.П.  19.11.1985     Москва      инженер

In [26]:
frame.Position

0    разработчик
1        инженер
2       менеджер
3    разработчик
4        инженер
Name: Position, dtype: object

In [27]:
frame[['Position']]

      Position
0  разработчик
1      инженер
2     менеджер
3  разработчик
4      инженер

In [44]:
frame.loc[[1,3], ['Name', 'City'] ]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов

In [66]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [68]:
frame['Birth']= frame.to_datetime(df['Date'])

In [71]:
frame[frame.Birth >= datetime.datetime(1985,1,1)]

              Name      Birth    City     Position
3  Мельникова Д.С. 1985-04-15  Ростов  разработчик
4      Рыбина Е.П. 1985-11-19  Москва      инженер

In [72]:
frame[(frame.Birth >= datetime.datetime(1985,1,1))&(frame.City != 'Москва')]

              Name      Birth    City     Position
3  Мельникова Д.С. 1985-04-15  Ростов  разработчик

In [73]:
frame[(frame.Birth >= datetime.datetime(1985,1,1))| (frame.City == 'Волгоград')]

              Name      Birth       City     Position
1     Сорокин И.В. 1965-07-08  Волгоград      инженер
3  Мельникова Д.С. 1985-04-15     Ростов  разработчик
4      Рыбина Е.П. 1985-11-19     Москва      инженер

In [75]:
frame['student'] = [False, True, False, True, True]

In [76]:
frame

              Name      Birth       City     Position  student
0      Иванов А.А. 1980-03-22     Москва  разработчик    False
1     Сорокин И.В. 1965-07-08  Волгоград      инженер     True
2       Белов М.М. 1980-02-13     Ростов     менеджер    False
3  Мельникова Д.С. 1985-04-15     Ростов  разработчик     True
4      Рыбина Е.П. 1985-11-19     Москва      инженер     True

In [77]:
frame['student2'] = False, True, False, True, True

In [78]:
frame

              Name      Birth       City     Position  student  student2
0      Иванов А.А. 1980-03-22     Москва  разработчик    False     False
1     Сорокин И.В. 1965-07-08  Волгоград      инженер     True      True
2       Белов М.М. 1980-02-13     Ростов     менеджер    False     False
3  Мельникова Д.С. 1985-04-15     Ростов  разработчик     True      True
4      Рыбина Е.П. 1985-11-19     Москва      инженер     True      True

In [79]:
frame['student3'] = (False, True, False, True, True)
frame

,Name,Birth,City,Position,student,student2,student3
0,Иванов А.А.,1980-03-22,Москва,разработчик,False,False,False
1,Сорокин И.В.,1965-07-08,Волгоград,инженер,True,True,True
2,Белов М.М.,1980-02-13,Ростов,менеджер,False,False,False
3,Мельникова Д.С.,1985-04-15,Ростов,разработчик,True,True,True
4,Рыбина Е.П.,1985-11-19,Москва,инженер,True,True,True

In [80]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
student               bool
student2              bool
student3              bool
dtype: object

In [81]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Birth     5 non-null      datetime64[ns]
 2   City      5 non-null      object
 3   Position  5 non-null      object
 4   student   5 non-null      bool
 5   student2  5 non-null      bool
 6   student3  5 non-null      bool
dtypes: bool(3), datetime64[ns](1), object(3)
memory usage: 387.0+ bytes